In [5]:
import pandas as pd

import numpy as np

In [4]:
pd.Series([10, 20, 30])

0    10
1    20
2    30
dtype: int64

In [13]:
a = pd.Series(range(100, 200, 10), dtype=np.float32)

In [14]:
a.dtype

dtype('float32')

In [8]:
pd.Series(10)

0    10
dtype: int64

In [7]:
pd.Series(np.arange(20, 30))

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
dtype: int64

In [15]:
name = ["Mohit", "Ravi", "Raju"]

In [16]:
age = [30, 32, 51]

In [17]:
d = {"name" : name, "age" : age}

In [19]:
df = pd.DataFrame(d)

In [20]:
df["name"]

0    Mohit
1     Ravi
2     Raju
Name: name, dtype: object

In [21]:
df["age"]

0    30
1    32
2    51
Name: age, dtype: int64

In [24]:
df["location"] = ["Noida", "Delhi", "Bhadurgarh"]

In [25]:
df

    name  age    location
0  Mohit   30       Noida
1   Ravi   32       Delhi
2   Raju   51  Bhadurgarh

In [26]:
df["rank"] = range(300, 309, 3)

In [28]:
df

    name  age    location  rank
0  Mohit   30       Noida   300
1   Ravi   32       Delhi   303
2   Raju   51  Bhadurgarh   306

In [33]:
a = pd.Series(["A sweet red fruit", "King of fruits"])

In [34]:
b = pd.Series(["A sweet red fruit", "King of fruits"], index=["Apple", "Mango"])

In [35]:
a

0    A sweet red fruit
1       King of fruits
dtype: object

In [36]:
b

Apple    A sweet red fruit
Mango       King of fruits
dtype: object

In [39]:
a[0]

'A sweet red fruit'

In [41]:
b["Apple"]

'A sweet red fruit'

In [42]:
d = {"Apple" : "Sweet red", "Mango" : "King"}

In [43]:
pd.Series(d)

Apple    Sweet red
Mango         King
dtype: object

In [44]:
name

['Mohit', 'Ravi', 'Raju']

In [45]:
age

[30, 32, 51]

In [48]:
c = pd.Series(dict(zip(name, age)))

In [49]:
list(a)

['A sweet red fruit', 'King of fruits']

In [50]:
list(c)

[30, 32, 51]

In [55]:
arr = np.random.randint(10, 20, (5, 5))

In [56]:
pd.DataFrame(arr)

    0   1   2   3   4
0  18  11  10  11  18
1  17  10  13  13  11
2  15  11  15  18  18
3  12  19  16  16  12
4  12  12  13  17  10

In [59]:
names = ["Anuj", "Mohan", "Ravi", "Bharat", "Hari"]

subjects = ["Phy", "Chem", "Math", "Eng", "Bio"]

df = pd.DataFrame(arr, index=names, columns=subjects)

In [61]:
df.to_html("data.html")

In [65]:
df.to_csv("data.csv")